//====================================================
//
// 配置エディタ処理 [disposition.cpp]
// Author:Rio Ohno
//
//====================================================

// インクルード
#include"disposition.h"
#include"manager.h"

// 静的メンバ変数
CObject3D* CDisposition::m_pObjecct3D = { NULL };

//====================================================
// コンストラクタ
//====================================================
CDisposition::CDisposition()
{

}

//====================================================
// デストラクタ
//====================================================
CDisposition::~CDisposition()
{
	// なし
}

//====================================================
// 初期化処理
//====================================================
HRESULT CDisposition::Init(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	// 地面
	m_pObjecct3D = CObject3D::Create(D3DXVECTOR3(0.0f, 0.0f, 0.0f), D3DXVECTOR3(0.0f, 0.0f, 0.0f), 300.0f, 300.0f);

	// テクスチャクラスの取得
	CTexture* pTexture = CManager::GetTexture();

	// テクスチャの割当
	if (pTexture != nullptr)
	{
		m_pObjecct3D->BindTexIndex(pTexture->TYPE_FILED);
	}

	return S_OK;
}

//====================================================
// 終了処理
//====================================================
void CDisposition::Uninit(void)
{
	// オブジェクトの破棄
	CObject::Release();
}

//====================================================
// 更新処理
//====================================================
void CDisposition::Update(void)
{

}

//====================================================
// 描画処理
//====================================================
void CDisposition::Draw(void)
{

}

//====================================================
// 書込処理
//====================================================
void CDisposition::Save(void)
{

}

//====================================================
// 読込処理
//====================================================
void CDisposition::Load(void)
{

}